:PROPERTIES:
:ID:       5c474950-ff5b-48a6-8161-cf6bf25f89f4
:header-ars:shell: :noweb yes
:END:
#+title: pip
#+filetags: :python:
#+date: [2024-05-12 日]
#+last_modified: [2024-07-05 五 21:44]





#+BEGIN_SRC shell
  
  pip install -i https://pypi.tuna.tsinghua.edu.cn/simple torch torchvision torchaudio
#+END_SRC

#+RESULTS:
| Collecting                               | package                                                                                                                                                                               | metadata                    | (current_repodata.json):                 | ...working...                   | failed                                               |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Looking                                  | in                                                                                                                                                                                    | indexes:                    | https://pypi.tuna.tsinghua.edu.cn/simple |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Collecting                               | torch                                                                                                                                                                                 |                             |                                          |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Downloading                              | https://pypi.tuna.tsinghua.edu.cn/packages/35/3a/a39f354fa3119785be87e2f94ffa2620f8a270c8560f7356358ee62fb4c5/torch-2.3.0-cp311-cp311-manylinux1_x86_64.whl                           | (779.2                      | MB)                                      |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━  | 779.2/779.2                                                                                                                                                                           | MB                          | 4.8                                      | MB/s                            | eta                                                  |                    0:00:00 |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Collecting                               | torchvision                                                                                                                                                                           |                             |                                          |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Downloading                              | https://pypi.tuna.tsinghua.edu.cn/packages/6e/7d/bc67ec2d1011226e75cdcc45a2c85d97b8eaac32a7d648b71c432d584367/torchvision-0.18.0-cp311-cp311-manylinux1_x86_64.whl                    | (7.0                        | MB)                                      |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ | 7.0/7.0                                                                                                                                                                               | MB                          | 6.2                                      | MB/s                            | eta                                                  |                    0:00:00 |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Collecting                               | torchaudio                                                                                                                                                                            |                             |                                          |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Downloading                              | https://pypi.tuna.tsinghua.edu.cn/packages/51/9e/3b31f93a56d32f10db44bad3236a834c9e57fab66a9c6e5149ea666bb927/torchaudio-2.3.0-cp311-cp311-manylinux1_x86_64.whl                      | (3.4                        | MB)                                      |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ | 3.4/3.4                                                                                                                                                                               | MB                          | 6.5                                      | MB/s                            | eta                                                  |                    0:00:00 |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Requirement                              | already                                                                                                                                                                               | satisfied:                  | filelock                                 | in                              | /home/lyt0628/anaconda3/lib/python3.11/site-packages |                      (from | torch)                      | (3.9.0)                       |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Collecting                               | typing-extensions>=4.8.0                                                                                                                                                              | (from                       | torch)                                   |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Downloading                              | https://pypi.tuna.tsinghua.edu.cn/packages/01/f3/936e209267d6ef7510322191003885de524fc48d1b43269810cd589ceaf5/typing_extensions-4.11.0-py3-none-any.whl                               | (34                         | kB)                                      |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Requirement                              | already                                                                                                                                                                               | satisfied:                  | sympy                                    | in                              | /home/lyt0628/anaconda3/lib/python3.11/site-packages |                      (from | torch)                      | (1.11.1)                      |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Requirement                              | already                                                                                                                                                                               | satisfied:                  | networkx                                 | in                              | /home/lyt0628/anaconda3/lib/python3.11/site-packages |                      (from | torch)                      | (3.1)                         |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Requirement                              | already                                                                                                                                                                               | satisfied:                  | jinja2                                   | in                              | /home/lyt0628/anaconda3/lib/python3.11/site-packages |                      (from | torch)                      | (3.1.2)                       |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Requirement                              | already                                                                                                                                                                               | satisfied:                  | fsspec                                   | in                              | /home/lyt0628/anaconda3/lib/python3.11/site-packages |                      (from | torch)                      | (2023.4.0)                    |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Collecting                               | nvidia-cuda-nvrtc-cu12==12.1.105                                                                                                                                                      | (from                       | torch)                                   |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Downloading                              | https://pypi.tuna.tsinghua.edu.cn/packages/b6/9f/c64c03f49d6fbc56196664d05dba14e3a561038a81a638eeb47f4d4cfd48/nvidia_cuda_nvrtc_cu12-12.1.105-py3-none-manylinux1_x86_64.whl          | (23.7                       | MB)                                      |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ | 23.7/23.7                                                                                                                                                                             | MB                          | 7.2                                      | MB/s                            | eta                                                  |                    0:00:00 |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Collecting                               | nvidia-cuda-runtime-cu12==12.1.105                                                                                                                                                    | (from                       | torch)                                   |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Downloading                              | https://pypi.tuna.tsinghua.edu.cn/packages/eb/d5/c68b1d2cdfcc59e72e8a5949a37ddb22ae6cade80cd4a57a84d4c8b55472/nvidia_cuda_runtime_cu12-12.1.105-py3-none-manylinux1_x86_64.whl        | (823                        | kB)                                      |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━  | 823.6/823.6                                                                                                                                                                           | kB                          | 4.6                                      | MB/s                            | eta                                                  |                    0:00:00 |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Collecting                               | nvidia-cuda-cupti-cu12==12.1.105                                                                                                                                                      | (from                       | torch)                                   |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Downloading                              | https://pypi.tuna.tsinghua.edu.cn/packages/7e/00/6b218edd739ecfc60524e585ba8e6b00554dd908de2c9c66c1af3e44e18d/nvidia_cuda_cupti_cu12-12.1.105-py3-none-manylinux1_x86_64.whl          | (14.1                       | MB)                                      |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ | 14.1/14.1                                                                                                                                                                             | MB                          | 8.3                                      | MB/s                            | eta                                                  |                    0:00:00 |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Collecting                               | nvidia-cudnn-cu12==8.9.2.26                                                                                                                                                           | (from                       | torch)                                   |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Downloading                              | https://pypi.tuna.tsinghua.edu.cn/packages/ff/74/a2e2be7fb83aaedec84f391f082cf765dfb635e7caa9b49065f73e4835d8/nvidia_cudnn_cu12-8.9.2.26-py3-none-manylinux1_x86_64.whl               | (731.7                      | MB)                                      |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━  | 731.7/731.7                                                                                                                                                                           | MB                          | 3.9                                      | MB/s                            | eta                                                  |                    0:00:00 |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Collecting                               | nvidia-cublas-cu12==12.1.3.1                                                                                                                                                          | (from                       | torch)                                   |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Downloading                              | https://pypi.tuna.tsinghua.edu.cn/packages/37/6d/121efd7382d5b0284239f4ab1fc1590d86d34ed4a4a2fdb13b30ca8e5740/nvidia_cublas_cu12-12.1.3.1-py3-none-manylinux1_x86_64.whl              | (410.6                      | MB)                                      |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━  | 410.6/410.6                                                                                                                                                                           | MB                          | 4.6                                      | MB/s                            | eta                                                  |                    0:00:00 |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Collecting                               | nvidia-cufft-cu12==11.0.2.54                                                                                                                                                          | (from                       | torch)                                   |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Downloading                              | https://pypi.tuna.tsinghua.edu.cn/packages/86/94/eb540db023ce1d162e7bea9f8f5aa781d57c65aed513c33ee9a5123ead4d/nvidia_cufft_cu12-11.0.2.54-py3-none-manylinux1_x86_64.whl              | (121.6                      | MB)                                      |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━  | 121.6/121.6                                                                                                                                                                           | MB                          | 4.0                                      | MB/s                            | eta                                                  |                    0:00:00 |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Collecting                               | nvidia-curand-cu12==10.3.2.106                                                                                                                                                        | (from                       | torch)                                   |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Downloading                              | https://pypi.tuna.tsinghua.edu.cn/packages/44/31/4890b1c9abc496303412947fc7dcea3d14861720642b49e8ceed89636705/nvidia_curand_cu12-10.3.2.106-py3-none-manylinux1_x86_64.whl            | (56.5                       | MB)                                      |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ | 56.5/56.5                                                                                                                                                                             | MB                          | 5.4                                      | MB/s                            | eta                                                  |                    0:00:00 |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Collecting                               | nvidia-cusolver-cu12==11.4.5.107                                                                                                                                                      | (from                       | torch)                                   |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Downloading                              | https://pypi.tuna.tsinghua.edu.cn/packages/bc/1d/8de1e5c67099015c834315e333911273a8c6aaba78923dd1d1e25fc5f217/nvidia_cusolver_cu12-11.4.5.107-py3-none-manylinux1_x86_64.whl          | (124.2                      | MB)                                      |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━  | 124.2/124.2                                                                                                                                                                           | MB                          | 5.3                                      | MB/s                            | eta                                                  |                    0:00:00 |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Collecting                               | nvidia-cusparse-cu12==12.1.0.106                                                                                                                                                      | (from                       | torch)                                   |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Downloading                              | https://pypi.tuna.tsinghua.edu.cn/packages/65/5b/cfaeebf25cd9fdec14338ccb16f6b2c4c7fa9163aefcf057d86b9cc248bb/nvidia_cusparse_cu12-12.1.0.106-py3-none-manylinux1_x86_64.whl          | (196.0                      | MB)                                      |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━  | 196.0/196.0                                                                                                                                                                           | MB                          | 5.2                                      | MB/s                            | eta                                                  |                    0:00:00 |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Collecting                               | nvidia-nccl-cu12==2.20.5                                                                                                                                                              | (from                       | torch)                                   |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Downloading                              | https://pypi.tuna.tsinghua.edu.cn/packages/4b/2a/0a131f572aa09f741c30ccd45a8e56316e8be8dfc7bc19bf0ab7cfef7b19/nvidia_nccl_cu12-2.20.5-py3-none-manylinux2014_x86_64.whl               | (176.2                      | MB)                                      |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━  | 176.2/176.2                                                                                                                                                                           | MB                          | 4.7                                      | MB/s                            | eta                                                  |                    0:00:00 |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Collecting                               | nvidia-nvtx-cu12==12.1.105                                                                                                                                                            | (from                       | torch)                                   |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Downloading                              | https://pypi.tuna.tsinghua.edu.cn/packages/da/d3/8057f0587683ed2fcd4dbfbdfdfa807b9160b809976099d36b8f60d08f03/nvidia_nvtx_cu12-12.1.105-py3-none-manylinux1_x86_64.whl                | (99                         | kB)                                      |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ | 99.1/99.1                                                                                                                                                                             | kB                          | 4.6                                      | MB/s                            | eta                                                  |                    0:00:00 |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Collecting                               | triton==2.3.0                                                                                                                                                                         | (from                       | torch)                                   |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Downloading                              | https://pypi.tuna.tsinghua.edu.cn/packages/3c/00/84e0006f2025260fa111ddfc66194bd1af731b3ee18e2fd611a00f290b5e/triton-2.3.0-cp311-cp311-manylinux_2_17_x86_64.manylinux2014_x86_64.whl | (168.1                      | MB)                                      |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━  | 168.1/168.1                                                                                                                                                                           | MB                          | 5.0                                      | MB/s                            | eta                                                  |                    0:00:00 |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Collecting                               | nvidia-nvjitlink-cu12                                                                                                                                                                 | (from                       | nvidia-cusolver-cu12==11.4.5.107->torch) |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Downloading                              | https://pypi.tuna.tsinghua.edu.cn/packages/ff/ff/847841bacfbefc97a00036e0fce5a0f086b640756dc38caea5e1bb002655/nvidia_nvjitlink_cu12-12.4.127-py3-none-manylinux2014_x86_64.whl        | (21.1                       | MB)                                      |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ | 21.1/21.1                                                                                                                                                                             | MB                          | 5.7                                      | MB/s                            | eta                                                  |                    0:00:00 |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Requirement                              | already                                                                                                                                                                               | satisfied:                  | numpy                                    | in                              | /home/lyt0628/anaconda3/lib/python3.11/site-packages |                      (from | torchvision)                | (1.24.3)                      |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Requirement                              | already                                                                                                                                                                               | satisfied:                  | pillow!=8.3.*,>=5.3.0                    | in                              | /home/lyt0628/anaconda3/lib/python3.11/site-packages |                      (from | torchvision)                | (9.4.0)                       |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Requirement                              | already                                                                                                                                                                               | satisfied:                  | MarkupSafe>=2.0                          | in                              | /home/lyt0628/anaconda3/lib/python3.11/site-packages |                      (from | jinja2->torch)              | (2.1.1)                       |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Requirement                              | already                                                                                                                                                                               | satisfied:                  | mpmath>=0.19                             | in                              | /home/lyt0628/anaconda3/lib/python3.11/site-packages |                      (from | sympy->torch)               | (1.3.0)                       |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Installing                               | collected                                                                                                                                                                             | packages:                   | typing-extensions,                       | triton,                         | nvidia-nvtx-cu12,                                    |     nvidia-nvjitlink-cu12, | nvidia-nccl-cu12,           | nvidia-curand-cu12,           | nvidia-cufft-cu12,              | nvidia-cuda-runtime-cu12,       | nvidia-cuda-nvrtc-cu12, | nvidia-cuda-cupti-cu12,        | nvidia-cublas-cu12,       | nvidia-cusparse-cu12, | nvidia-cudnn-cu12, | nvidia-cusolver-cu12, | torch,       | torchvision,             | torchaudio |
| Attempting                               | uninstall:                                                                                                                                                                            | typing-extensions           |                                          |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Found                                    | existing                                                                                                                                                                              | installation:               | typing_extensions                        | 4.7.1                           |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Uninstalling                             | typing_extensions-4.7.1:                                                                                                                                                              |                             |                                          |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Successfully                             | uninstalled                                                                                                                                                                           | typing_extensions-4.7.1     |                                          |                                 |                                                      |                            |                             |                               |                                 |                                 |                         |                                |                           |                       |                    |                       |              |                          |            |
| Successfully                             | installed                                                                                                                                                                             | nvidia-cublas-cu12-12.1.3.1 | nvidia-cuda-cupti-cu12-12.1.105          | nvidia-cuda-nvrtc-cu12-12.1.105 | nvidia-cuda-runtime-cu12-12.1.105                    | nvidia-cudnn-cu12-8.9.2.26 | nvidia-cufft-cu12-11.0.2.54 | nvidia-curand-cu12-10.3.2.106 | nvidia-cusolver-cu12-11.4.5.107 | nvidia-cusparse-cu12-12.1.0.106 | nvidia-nccl-cu12-2.20.5 | nvidia-nvjitlink-cu12-12.4.127 | nvidia-nvtx-cu12-12.1.105 | torch-2.3.0           | torchaudio-2.3.0   | torchvision-0.18.0    | triton-2.3.0 | typing-extensions-4.11.0 |            |


#+BEGIN_SRC shell
  pip install tensorflow
#+END_SRC
